frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/abdacb.h
#define ABDACB_VCR0_VOLUME_Pos      0            /**< \brief (ABDACB_VCR0) Volume Control */
#define ABDACB_VCR0_VOLUME_Msk      (_U(0x7FFF) << ABDACB_VCR0_VOLUME_Pos)
#define ABDACB_VCR0_VOLUME(value)   (ABDACB_VCR0_VOLUME_Msk & ((value) << ABDACB_VCR0_VOLUME_Pos))
#define ABDACB_VCR0_MUTE_Pos        31           /**< \brief (ABDACB_VCR0) Mute */
#define ABDACB_VCR0_MUTE            (_U(0x1) << ABDACB_VCR0_MUTE_Pos)
#define ABDACB_VCR0_MASK            _U(0x80007FFF) /**< \brief (ABDACB_VCR0) MASK Register */

/* -------- ABDACB_VCR1 : (ABDACB Offset: 0x10) (R/W 32) Volume Control Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VOLUME:15;        /*!< bit:  0..14  Volume Control                     */
    uint32_t :16;              /*!< bit: 15..30  Reserved                           */
    uint32_t MUTE:1;           /*!< bit:     31  Mute                               */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ABDACB_VCR1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ABDACB_VCR1_OFFSET          0x10         /**< \brief (ABDACB_VCR1 offset) Volume Control Register 1 */
#define ABDACB_VCR1_RESETVALUE      _U(0x00000000); /**< \brief (ABDACB_VCR1 reset_value) Volume Control Register 1 */

#define ABDACB_VCR1_VOLUME_Pos      0            /**< \brief (ABDACB_VCR1) Volume Control */
#define ABDACB_VCR1_VOLUME_Msk      (_U(0x7FFF) << ABDACB_VCR1_VOLUME_Pos)
#define ABDACB_VCR1_VOLUME(value)   (ABDACB_VCR1_VOLUME_Msk & ((value) << ABDACB_VCR1_VOLUME_Pos))
#define ABDACB_VCR1_MUTE_Pos        31           /**< \brief (ABDACB_VCR1) Mute */
#define ABDACB_VCR1_MUTE            (_U(0x1) << ABDACB_VCR1_MUTE_Pos)
#define ABDACB_VCR1_MASK            _U(0x80007FFF) /**< \brief (ABDACB_VCR1) MASK Register */

/* -------- ABDACB_IER : (ABDACB Offset: 0x14) ( /W 32) Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :1;               /*!< bit:      0  Reserved                           */
    uint32_t TXRDY:1;          /*!< bit:      1  Transmit Ready Interrupt Enable    */
    uint32_t TXUR:1;           /*!< bit:      2  Transmit Underrun Interrupt Enable */
    uint32_t :29;              /*!< bit:  3..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ABDACB_IER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ABDACB_IER_OFFSET           0x14         /**< \brief (ABDACB_IER offset) Interrupt Enable Register */
#define ABDACB_IER_RESETVALUE       _U(0x00000000); /**< \brief (ABDACB_IER reset_value) Interrupt Enable Register */

#define ABDACB_IER_TXRDY_Pos        1            /**< \brief (ABDACB_IER) Transmit Ready Interrupt Enable */
#define ABDACB_IER_TXRDY            (_U(0x1) << ABDACB_IER_TXRDY_Pos)
#define   ABDACB_IER_TXRDY_0_Val          _U(0x0)   /**< \brief (ABDACB_IER) No effect */
#define   ABDACB_IER_TXRDY_1_Val          _U(0x1)   /**< \brief (ABDACB_IER) Enables the Audio DAC TX Ready interrupt */
#define ABDACB_IER_TXRDY_0          (ABDACB_IER_TXRDY_0_Val        << ABDACB_IER_TXRDY_Pos)
#define ABDACB_IER_TXRDY_1          (ABDACB_IER_TXRDY_1_Val        << ABDACB_IER_TXRDY_Pos)
#define ABDACB_IER_TXUR_Pos         2            /**< \brief (ABDACB_IER) Transmit Underrun Interrupt Enable */
#define ABDACB_IER_TXUR             (_U(0x1) << ABDACB_IER_TXUR_Pos)
#define   ABDACB_IER_TXUR_0_Val           _U(0x0)   /**< \brief (ABDACB_IER) No effect */
#define   ABDACB_IER_TXUR_1_Val           _U(0x1)   /**< \brief (ABDACB_IER) Enables the Audio DAC Underrun interrupt */
#define ABDACB_IER_TXUR_0           (ABDACB_IER_TXUR_0_Val         << ABDACB_IER_TXUR_Pos)
#define ABDACB_IER_TXUR_1           (ABDACB_IER_TXUR_1_Val         << ABDACB_IER_TXUR_Pos)
#define ABDACB_IER_MASK             _U(0x00000006) /**< \brief (ABDACB_IER) MASK Register */

/* -------- ABDACB_IDR : (ABDACB Offset: 0x18) ( /W 32) Interupt Disable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :1;               /*!< bit:      0  Reserved                           */
    uint32_t TXRDY:1;          /*!< bit:      1  Transmit Ready Interrupt Disable   */
    uint32_t TXUR:1;           /*!< bit:      2  Transmit Underrun Interrupt Disable */
    uint32_t :29;              /*!< bit:  3..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ABDACB_IDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ABDACB_IDR_OFFSET           0x18         /**< \brief (ABDACB_IDR offset) Interupt Disable Register */
#define ABDACB_IDR_RESETVALUE       _U(0x00000000); /**< \brief (ABDACB_IDR reset_value) Interupt Disable Register */

#define ABDACB_IDR_TXRDY_Pos        1            /**< \brief (ABDACB_IDR) Transmit Ready Interrupt Disable */
#define ABDACB_IDR_TXRDY            (_U(0x1) << ABDACB_IDR_TXRDY_Pos)
#define   ABDACB_IDR_TXRDY_0_Val          _U(0x0)   /**< \brief (ABDACB_IDR) No effect */
#define   ABDACB_IDR_TXRDY_1_Val          _U(0x1)   /**< \brief (ABDACB_IDR) Disable the Audio DAC TX Ready interrupt */
#define ABDACB_IDR_TXRDY_0          (ABDACB_IDR_TXRDY_0_Val        << ABDACB_IDR_TXRDY_Pos)
#define ABDACB_IDR_TXRDY_1          (ABDACB_IDR_TXRDY_1_Val        << ABDACB_IDR_TXRDY_Pos)
#define ABDACB_IDR_TXUR_Pos         2            /**< \brief (ABDACB_IDR) Transmit Underrun Interrupt Disable */
#define ABDACB_IDR_TXUR             (_U(0x1) << ABDACB_IDR_TXUR_Pos)
#define   ABDACB_IDR_TXUR_0_Val           _U(0x0)   /**< \brief (ABDACB_IDR) No effect */
#define   ABDACB_IDR_TXUR_1_Val           _U(0x1)   /**< \brief (ABDACB_IDR) Disable the Audio DAC Underrun interrupt */
#define ABDACB_IDR_TXUR_0           (ABDACB_IDR_TXUR_0_Val         << ABDACB_IDR_TXUR_Pos)
#define ABDACB_IDR_TXUR_1           (ABDACB_IDR_TXUR_1_Val         << ABDACB_IDR_TXUR_Pos)
#define ABDACB_IDR_MASK             _U(0x00000006) /**< \brief (ABDACB_IDR) MASK Register */

/* -------- ABDACB_IMR : (ABDACB Offset: 0x1C) (R/  32) Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :1;               /*!< bit:      0  Reserved                           */
    uint32_t TXRDY:1;          /*!< bit:      1  Transmit Ready Interrupt Mask      */
    uint32_t TXUR:1;           /*!< bit:      2  Transmit Underrun Interrupt Mask   */
    uint32_t :29;              /*!< bit:  3..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ABDACB_IMR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ABDACB_IMR_OFFSET           0x1C         /**< \brief (ABDACB_IMR offset) Interrupt Mask Register */
#define ABDACB_IMR_RESETVALUE       _U(0x00000000); /**< \brief (ABDACB_IMR reset_value) Interrupt Mask Register */

#define ABDACB_IMR_TXRDY_Pos        1            /**< \brief (ABDACB_IMR) Transmit Ready Interrupt Mask */
#define ABDACB_IMR_TXRDY            (_U(0x1) << ABDACB_IMR_TXRDY_Pos)
#define   ABDACB_IMR_TXRDY_0_Val          _U(0x0)   /**< \brief (ABDACB_IMR) The Audio DAC TX Ready interrupt is disabled */
#define   ABDACB_IMR_TXRDY_1_Val          _U(0x1)   /**< \brief (ABDACB_IMR) The Audio DAC TX Ready interrupt is enabled */
#define ABDACB_IMR_TXRDY_0          (ABDACB_IMR_TXRDY_0_Val        << ABDACB_IMR_TXRDY_Pos)
#define ABDACB_IMR_TXRDY_1          (ABDACB_IMR_TXRDY_1_Val        << ABDACB_IMR_TXRDY_Pos)
#define ABDACB_IMR_TXUR_Pos         2            /**< \brief (ABDACB_IMR) Transmit Underrun Interrupt Mask */
#define ABDACB_IMR_TXUR             (_U(0x1) << ABDACB_IMR_TXUR_Pos)
#define   ABDACB_IMR_TXUR_0_Val           _U(0x0)   /**< \brief (ABDACB_IMR) The Audio DAC Underrun interrupt is disabled */
#define   ABDACB_IMR_TXUR_1_Val           _U(0x1)   /**< \brief (ABDACB_IMR) The Audio DAC Underrun interrupt is enabled */
#define ABDACB_IMR_TXUR_0           (ABDACB_IMR_TXUR_0_Val         << ABDACB_IMR_TXUR_Pos)
#define ABDACB_IMR_TXUR_1           (ABDACB_IMR_TXUR_1_Val         << ABDACB_IMR_TXUR_Pos)
#define ABDACB_IMR_MASK             _U(0x00000006) /**< \brief (ABDACB_IMR) MASK Register */

/* -------- ABDACB_SR : (ABDACB Offset: 0x20) (R/  32) Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t BUSY:1;           /*!< bit:      0  ABDACB Busy                        */
    uint32_t TXRDY:1;          /*!< bit:      1  Transmit Ready                     */
    uint32_t TXUR:1;           /*!< bit:      2  Transmit Underrun                  */
    uint32_t :29;              /*!< bit:  3..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ABDACB_SR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ABDACB_SR_OFFSET            0x20         /**< \brief (ABDACB_SR offset) Status Register */
#define ABDACB_SR_RESETVALUE        _U(0x00000000); /**< \brief (ABDACB_SR reset_value) Status Register */

